// Exercise 1 — [Rust_Compro_01]
// Problem

// [กำหนดให้ numbers มีค่า [10, 20, 30, 40, 50] จงใช้ Slice เพื่อเลือกข้อมูล 20, 30, 40 และเปลี่ยนค่าเป็น 200, 300, 400 จากนั้นแสดงผลข้อมูลที่ถูกเปลี่ยนแปลงแล้ว โดยห้ามเปลี่ยนค่าใน numbers โดยตรง ให้แก้ไขข้อมูลผ่าน Slice เท่านั้น]

// Hint

// [ให้ใช้ Slice เพื่อเลือกเฉพาะข้อมูล 20, 30, 40 จาก numbers โดยกำหนดช่วงให้ถูกต้อง จากนั้นใช้การยืมแบบ Mutable เพื่อให้สามารถแก้ไขค่าผ่าน Slice ได้ และแสดงผล]

// Solution

fn main() {
    let mut numbers = [10, 20, 30, 40, 50];

    let x = &mut numbers[1..4];

    x[0] = 200;
    x[1] = 300;
    x[2] = 400;

    println!("{:?}", x);
}
